УТ/src/DataProcessors/ЖурналБилетовИБронирований/ЖурналБилетовИБронирований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЖурналБилетовИБронирований</name>
</mdclass:DataProcessor>

УТ/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеестрДокументов</name>
  <resources>
    <name>НомерДокументаИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПеремещенийТоваров</types>
      <types>EnumRef.СтатусыАктаОРасхождениях</types>
      <types>EnumRef.СтатусыСборокТоваров</types>
      <types>EnumRef.СтатусыЗаявокНаВозвратТоваровОтКлиентов</types>
      <types>EnumRef.СтатусыВнутреннихПотреблений</types>
      <types>EnumRef.СтатусыАктовКонтроляКачества</types>
      <types>EnumRef.СтатусыЗаявокНаРасходованиеДенежныхСредств</types>
      <types>EnumRef.СтатусыАвансовогоОтчета</types>
      <types>EnumRef.СтатусыДокументовРетроБонусов</types>
      <types>EnumRef.СтатусыТаможенныхДеклараций</types>
      <types>EnumRef.СтатусыЗаказовКлиентов</types>
      <types>EnumRef.СтатусыЗаказовПоставщикам</types>
      <types>EnumRef.СтатусыЗаявокСотрудников</types>
      <types>EnumRef.СтатусыРеализацийТоваровУслуг</types>
      <types>EnumRef.СтатусыВнутреннихЗаказов</types>
      <types>EnumRef.СтатусыАктовПремийКлиентам</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Дополнительно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПервичногоДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.ДоговорыЭквайринга</types>
    </type>
  </resources>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтраженияВУчете</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыОплаты</types>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </resources>
  <resources>
    <name>СторнируемыйДокумент</name>
    <type>
      <types>DefinedType.ИсправляемыеДокументы</types>
    </type>
  </resources>
  <resources>
    <name>ИсправляемыйДокумент</name>
    <type>
      <types>DefinedType.ИсправляемыеДокументы</types>
    </type>
  </resources>
  <resources>
    <name>СторноИсправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>НаименованиеПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипСсылки</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаИБ</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.КлючиРеестраДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КлючиРеестраДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <comment>Подразделение, оформившее документ</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>DocumentRef.АктОРасхожденияхПослеПеремещения</types>
      <types>DocumentRef.ЗаписьКнигиПокупок</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АктОРасхожденияхПослеОтгрузки</types>
      <types>DocumentRef.БронированиеSmartway</types>
      <types>DocumentRef.ПоступлениеУслугВПодразделение</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.УведомлениеОВвозеПрослеживаемыхТоваров</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.СчетФактураПолученныйАванс</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ИнойДокументПодтвержденияНДС</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.НачислениеРеверсивногоНДС</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ОперацияСЭлектроннымБилетом</types>
      <types>DocumentRef.ВнесениеДенежныхСредствВКассуККМ</types>
      <types>DocumentRef.РасчетКурсовыхРазниц</types>
      <types>DocumentRef.РегистраторРасчетаСебестоимости</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ОтгрузкаТоваровСХранения</types>
      <types>DocumentRef.ЗаявкаНаКомандировку</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.АктОРасхожденияхПослеПриемки</types>
      <types>DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</types>
      <types>DocumentRef.РаспределениеДоходовПоНаправлениямДеятельности</types>
      <types>DocumentRef.ВводОстатковДенежныхСредств</types>
      <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
      <types>DocumentRef.АктПремииКлиенту</types>
      <types>DocumentRef.ОперацияПоЯндексКассе</types>
      <types>DocumentRef.ВводОстатковТМЦВЭксплуатации</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.КорректировкаГрафикаВзаиморасчетов</types>
      <types>DocumentRef.ИнвентаризационнаяОпись</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.СчетФактураВыданныйАванс</types>
      <types>DocumentRef.МаркировкаТоваровГИСМ</types>
      <types>DocumentRef.КорректировкаНалогообложенияНДСПартийТоваров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.СводнаяСправкаНДС</types>
      <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.ПоступлениеТоваровОтКлиента</types>
      <types>DocumentRef.СписаниеНДСНаРасходы</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>DocumentRef.ПоступлениеТоваровОтХранителя</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.АктКонтроляКачестваТоваров</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.Сторно</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.ПересортицаТоваровУХранителя</types>
      <types>DocumentRef.ВводОстатковНДСПредъявленного</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
      <types>DocumentRef.КорректировкаНазначенияТоваров</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АннулированиеПодарочныхСертификатов</types>
      <types>DocumentRef.АктПремииПоставщика</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ВводОстатковПоФинансовымИнструментам</types>
      <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
      <types>DocumentRef.ПодтверждениеНулевойСтавкиНДС</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.УсловияРетроБонусовКлиентов</types>
      <types>DocumentRef.ОтчетОРозничныхВозвратах</types>
      <types>DocumentRef.ДокументОПредстоящейПоставке</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ПриемкаТоваровНаХранение</types>
      <types>DocumentRef.СписаниеОтгруженныхТоваров</types>
      <types>DocumentRef.ИсправлениеРазвернутогоСальдоТоваровОрганизаций</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ВводОстатковТоваров</types>
      <types>DocumentRef.ВводОстатковПрочиеРасходы</types>
      <types>DocumentRef.СчетФактураКомиссионеру</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.КорректировкаРасчетовСПодотчетнымиЛицами</types>
      <types>DocumentRef.ЗаявкаНаКонтрольКачестваТоваров</types>
      <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.РасчетСебестоимостиТоваров</types>
      <types>DocumentRef.СчетНаОплатуКлиенту</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.РеализацияПодарочныхСертификатов</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаписьКнигиПродаж</types>
      <types>DocumentRef.ВозвратПодарочныхСертификатов</types>
      <types>DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВыкупТоваровХранителем</types>
      <types>DocumentRef.КорректировкаВидаДеятельностиНДС</types>
      <types>DocumentRef.ВводОстатковВзаиморасчетов</types>
      <types>DocumentRef.ВводОстатковРасчетовПоЭквайрингу</types>
      <types>DocumentRef.СписаниеРасхожденийПоступлениеПриобретение</types>
      <types>DocumentRef.ОприходованиеИзлишковОтгруженныхТоваров</types>
      <types>DocumentRef.УсловияРетроБонусовПоставщика</types>
      <types>DocumentRef.СчетФактураПолученныйНалоговыйАгент</types>
      <types>DocumentRef.ВводОстатковСПодотчетниками</types>
      <types>DocumentRef.ПорчаТоваров</types>
      <types>DocumentRef.ОтгрузкаТоваровКлиенту</types>
      <types>DocumentRef.СчетФактураНалоговыйАгент</types>
      <types>DocumentRef.СчетФактураКомитента</types>
      <types>DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</types>
      <types>DocumentRef.РаспределениеНДС</types>
      <types>DocumentRef.ОтчетКомитентуОЗакупках</types>
      <types>DocumentRef.ВводОстатковПрочихАктивовПассивов</types>
      <types>DocumentRef.ПорчаТоваровУХранителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделительЗаписи</name>
    <comment>Служебное измерение, предназначенное для укрупнения порции записи данных в регистр</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/УдалитьТипыБронирования/УдалитьТипыБронирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УдалитьТипыБронирования</name>
  <enumValues>
    <name>ЭлектронныйБилет</name>
  </enumValues>
  <enumValues>
    <name>Бронирование</name>
  </enumValues>
</mdclass:Enum>

УТ/src/DataProcessors/ЖурналБилетовИБронирований/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// НастройкиДинамическихСписков
	ИнициироватьНастройкиДинамическихСписков();
	СписокДокументовРежимАвтообновления = Истина;
	// Конец НастройкиДинамическихСписков
	
	Если Параметры.Свойство("КлючНазначенияФормы") И Не ПустаяСтрока(Параметры.КлючНазначенияФормы) Тогда
		КлючНазначенияИспользования = Параметры.КлючНазначенияФормы;
	Иначе
		КлючНазначенияИспользования = "ЭлектронныеБилетыИБронирования";
	КонецЕсли;
	
	Если КлючНазначенияИспользования = "ЭлектронныеБилетыИБронирования" Тогда
		КлючНастроек = "";
	Иначе
		КлючНастроек = КлючНазначенияИспользования;
	КонецЕсли;
	НавигационнаяСсылка = "e1cib/app/Обработка.ЖурналБилетовИБронирований";
	
	УстановитьТекстЗапросаСпискуДокументов();
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИдОбъектаОперацияСЭлектроннымБилетом",
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ОперацияСЭлектроннымБилетом"));
		
	//++ Локализация
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИдОбъектаБронирование",
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.БронированиеSmartway"));
		
	КомандаСозданияБронирования = Команды.Добавить("СоздатьБронирование");
	КомандаСозданияБронирования.Действие = "Подключаемый_СоздатьБронирование";
	
	ЭлементУправленияКомандой = Элементы.Добавить("СписокСоздатьБронирование", Тип("КнопкаФормы"), Элементы.ПодменюКнопокСоздать);
	ЭлементУправленияКомандой.ИмяКоманды = КомандаСозданияБронирования.Имя;
	ЭлементУправленияКомандой.Заголовок = НСтр("ru = 'Бронирование'");
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ТипДокументаБронирование", НСтр("ru = 'Бронирование'"));
	
	//-- Локализация
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ТипДокументаЭлектронныйБилет", НСтр("ru = 'Электронный билет'"));
	
	МетаданныеТиповОпераций = Метаданные.Перечисления.ТипыОперацийСБилетами.ЗначенияПеречисления;
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ТипДокументаДоплата", МетаданныеТиповОпераций.Доплата.Синоним);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ТипДокументаВозврат", МетаданныеТиповОпераций.Возврат.Синоним);
		
	// ПроверкаДокументовВРеглУчете
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	ЗаполнитьЗначенияСвойств(СвойстваСписка, СписокДокументов);
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокДокументов, СвойстваСписка);
	// Конец ПроверкаДокументовВРеглУчете
	
	УстановитьВидимостьДоступность();
	УстановитьОтборДинамическихСписков();
	НастроитьКнопкиУправленияДокументами();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	
	МассивТиповИсточников = Новый Массив;
	МассивТиповИсточников.Добавить(Тип("ДокументСсылка.ОперацияСЭлектроннымБилетом"));
	
	//++ Локализация
	МассивТиповИсточников.Добавить(Тип("ДокументСсылка.БронированиеSmartway"));
	//-- Локализация
	ПараметрыРазмещения.Источники = Новый ОписаниеТипов(МассивТиповИсточников);
	
	ПараметрыРазмещения.КоманднаяПанель = Элементы.СписокДокументовКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Не ЗначениеЗаполнено(ТекущийВариантОтбораДокументов) Тогда
		ТекущийВариантОтбораДокументов = ВариантОтбораДокументовПоУмолчанию();
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("МестоРазмещенияДанныхПроверкиРегл", Элементы.ГруппаРеглПроверка);
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// НастройкиДинамическихСписков
	УстановитьПараметрыОбновленияСписковДокументов(Ложь, 0);
	// Конец НастройкиДинамическихСписков
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Период            = Настройки.Получить("Период");
	Организация       = Настройки.Получить("Организация");
	Сотрудник         = Настройки.Получить("Сотрудник");
	
	// НастройкиДинамическихСписков
	РаботаСЖурналамиДокументов.УстановитьПризнакАвтообновленияСпискаДокументовПриЗагрузкеДанныхИзНастроек(ЭтотОбъект,
		"СписокДокументов", Настройки);
	// Конец НастройкиДинамическихСписков
	
	УстановитьОтборДинамическихСписков();
	
	Если Не ЗначениеЗаполнено(ТекущийВариантОтбораДокументов) Тогда
		ТекущийВариантОтбораДокументов = ВариантОтбораДокументовПоУмолчанию();
	КонецЕсли;
	ПрименитьВариантОтбораДокументов(ТекущийВариантОтбораДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_БилетовИБронирований" Тогда
		
		// НастройкиДинамическихСписков
		ОбновитьСписокДокументовСобытиеОбработкаОповещения("СписокДокументов", Параметр);
		// Конец НастройкиДинамическихСписков
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнформационнаяНадписьОтборОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьВыборВариантаОтбораДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОтборПриИзменении(Элемент)
	УстановитьОтборДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОтборПриИзменении(Элемент)
	УстановитьОтборДинамическихСписков();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияУТКлиент.ИзменитьЭлемент(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПриАктивизацииСтроки(Элемент)
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		ОбщегоНазначенияУТКлиент.СкопироватьЭлемент(Элемент);
	Иначе
		ПараметрыОснования = Новый Структура;
		ПараметрыОснования.Вставить("Организация", Организация);
		ПараметрыОснования.Вставить("Сотрудник", Сотрудник);
		
		ОткрытьФорму("Документ.ОперацияСЭлектроннымБилетом.Форма.ФормаДокумента", Новый Структура("Основание", ПараметрыОснования));
	КонецЕсли;
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОбщегоНазначенияУТКлиент.ИзменитьЭлемент(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ОбщегоНазначенияУТКлиент.УстановитьПометкуУдаления(Элемент, Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовСкопировать(Команда)
	
	ОбщегоНазначенияУТКлиент.СкопироватьЭлемент(Элементы.СписокДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовИзменить(Команда)
	
	ОбщегоНазначенияУТКлиент.ИзменитьЭлемент(Элементы.СписокДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовОтменаПроведения(Команда)
	
	ОбщегоНазначенияУТКлиент.ОтменаПроведения(Элементы.СписокДокументов, Заголовок,
		РаботаСЖурналамиДокументовКлиент.ПараметрыОбновленияСпискаДокументов(ЭтотОбъект, "СписокДокументов"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПровести(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиДокументы(Элементы.СписокДокументов, Заголовок,
		РаботаСЖурналамиДокументовКлиент.ПараметрыОбновленияСпискаДокументов(ЭтотОбъект, "СписокДокументов"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовУстановитьСнятьПометкуУдаления(Команда)
	
	ОбщегоНазначенияУТКлиент.УстановитьПометкуУдаления(Элементы.СписокДокументов, Заголовок, Неопределено,
		РаботаСЖурналамиДокументовКлиент.ПараметрыОбновленияСпискаДокументов(ЭтотОбъект, "СписокДокументов"));
	
КонецПроцедуры

&НаСервере
Процедура СписокДокументовПриОбновленииСоставаПользовательскихНастроекНаСервере(Элемент, СтандартнаяОбработка)
	
	// НастройкиДинамическихСписков
	РаботаСЖурналамиДокументов.УстановитьВидимостьГруппыНастройкиОбновленияПоУмолчанию(ЭтотОбъект, "СписокДокументов");
	// Конец НастройкиДинамическихСписков
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.СписокДокументов);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.СписокДокументов, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.СписокДокументов);
	ОбновитьКомандыСозданияДокументов();
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбновитьКомандыСозданияДокументов()
	
	Элементы.СписокСоздатьДоплату.Видимость = Ложь;
	Элементы.СписокСоздатьВозврат.Видимость = Ложь;
	
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОперацииБилетаДоступны = Элементы.СписокСоздатьБилет.Видимость
		И (ТекущийВариантОтбораДокументов = ВариантОтбораДокументовПоУмолчанию()
		Или ТекущийВариантОтбораДокументов = "ЭлектронныеБилетыИОперации");
	
	Элементы.СписокСоздатьДоплату.Видимость = ОперацииБилетаДоступны И ТекущиеДанные.ЭтоЭлектронныйБилет;
	Элементы.СписокСоздатьВозврат.Видимость = ОперацииБилетаДоступны И ТекущиеДанные.ЭтоЭлектронныйБилет;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБилет(Команда)
	
	ПараметрыОснования = Новый Структура;
	ПараметрыОснования.Вставить("Организация", Организация);
	ПараметрыОснования.Вставить("Сотрудник", Сотрудник);
	ОткрытьФорму("Документ.ОперацияСЭлектроннымБилетом.Форма.ФормаДокумента", Новый Структура("Основание", ПараметрыОснования));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоплату(Команда)
	СоздатьОперациюСЭлектроннымБилетом(ПредопределенноеЗначение("Перечисление.ТипыОперацийСБилетами.Доплата"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВозврат(Команда)
	СоздатьОперациюСЭлектроннымБилетом(ПредопределенноеЗначение("Перечисление.ТипыОперацийСБилетами.Возврат"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	ОбщегоНазначенияУтКлиент.РедактироватьПериод(Период,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранноеЗначение;
	УстановитьОтборПоПериоду();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеБронирования(Команда)
	
	//++ Локализация
	ДлительнаяОперация = НачатьПолучениеДанныхБронированияНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьПолучениеДанныхБронирования", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

//++ Локализация
&НаКлиенте
Процедура Подключаемый_СоздатьБронирование(Команда)
	ОткрытьФорму("Документ.БронированиеSmartway.Форма.ФормаДокумента");
КонецПроцедуры

&НаСервере
Функция НачатьПолучениеДанныхБронированияНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.КлючФоновогоЗадания = Метаданные.РегламентныеЗадания.ПолучениеДанныхСмартвей.Ключ;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "ИнтеграцияСмартвей.ПолучитьДанныеБронирования");
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПолучениеДанныхБронирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Для Каждого СообщениеРезультата Из Результат.Сообщения Цикл
		Если СообщениеРезультата.КлючДанных = Неопределено Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеРезультата.Текст);
		КонецЕсли;
	КонецЦикла;
	
	Элементы.СписокДокументов.Обновить();
	
КонецПроцедуры
//-- Локализация

&НаКлиенте
Процедура ОформитьКомандировку(Команда)
	
	//++ Локализация


	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовОбновить(Команда)
	
	// НастройкиДинамическихСписков
	ОбновитьДанныеСпискаДокументовСЗамеромВремени("СписокДокументов");
	// Конец НастройкиДинамическихСписков
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьОперациюСЭлектроннымБилетом(ТипОперации)
	
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОперации = Новый Структура;
	ОписаниеОперации.Вставить("ТипОперации", ТипОперации);
	ОписаниеОперации.Вставить("ЭтоПолныйВозврат", Ложь);
	
	ДанныеДляСозданияОперацииБилета = Новый Структура;
	ДанныеДляСозданияОперацииБилета.Вставить("ДанныеЭлектронногоБилета");
	ДанныеДляСозданияОперацииБилета.Вставить("ОписаниеОперации", ОписаниеОперации);
	ДанныеДляСозданияОперацииБилета.Вставить("ЭтоРазделениеБилета", Ложь);
	
	ПараметрыОснования = Новый Структура();
	ПараметрыОснования.Вставить("ЭлектронныйБилет", ТекущиеДанные.Ссылка);
	ПараметрыОснования.Вставить("ДанныеДляСозданияОперацииБилета", ДанныеДляСозданияОперацииБилета);
	
	ОткрытьФорму("Документ.ОперацияСЭлектроннымБилетом.Форма.ФормаОперацииЭлектронногоБилета", Новый Структура("Основание", ПараметрыОснования));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "СписокДокументов.Дата", Элементы.Дата.Имя);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокДокументов,
		"Организация",
		Организация,
		ВидСравненияКомпоновкиДанных.Равно,,
		ЗначениеЗаполнено(Организация));
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокДокументов,
		"Сотрудник",
		Сотрудник,
		ВидСравненияКомпоновкиДанных.Равно,,
		ЗначениеЗаполнено(Сотрудник));
		
	УстановитьОтборПоПериоду();
	
	// НастройкиДинамическихСписков
	РаботаСЖурналамиДокументов.УстановитьВидимостьГруппыНастройкиОбновленияПоУмолчанию(ЭтотОбъект, "СписокДокументов");
	// Конец НастройкиДинамическихСписков
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПериоду()
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("НачалоПериода", Период.ДатаНачала);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("КонецПериода", Период.ДатаОкончания);
	// НастройкиДинамическихСписков
	РаботаСЖурналамиДокументов.УстановитьВидимостьГруппыНастройкиОбновленияПоУмолчанию(ЭтотОбъект, "СписокДокументов");
	// Конец НастройкиДинамическихСписков
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Элементы.ОрганизацияОтбор.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Подразделение.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	
	//++ Локализация
	Элементы.СписокПолучитьДанныеБронирования.Видимость = Истина;
	Элементы.СписокОформитьКомандировку.Видимость = Истина;
	//-- Локализация
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКнопкиУправленияДокументами()
	
	ВидимостьКомандРедактирования = ПравоДоступа("Добавление", Метаданные.Документы.ОперацияСЭлектроннымБилетом);
	
	Если Не ВидимостьКомандРедактирования Тогда
		
		КомандыРедактирования = Новый Массив;
		КомандыРедактирования.Добавить(Элементы.СписокСоздатьБилет);
		КомандыРедактирования.Добавить(Элементы.СписокСоздатьДоплату);
		КомандыРедактирования.Добавить(Элементы.СписокСоздатьВозврат);
		
		//++ Локализация
		КомандыРедактирования.Добавить(Элементы.СписокСоздатьБронирование);
		//-- Локализация
		
		КомандыРедактирования.Добавить(Элементы.СписокСкопировать);
		КомандыРедактирования.Добавить(Элементы.СписокУстановитьСнятьПометкуУдаления);
		КомандыРедактирования.Добавить(Элементы.СписокПровести);
		КомандыРедактирования.Добавить(Элементы.СписокОтменаПроведения);
		КомандыРедактирования.Добавить(Элементы.СписокКонтекстноеМенюСкопировать);
		КомандыРедактирования.Добавить(Элементы.СписокКонтекстноеМенюУстановитьПометкуУдаления);
		КомандыРедактирования.Добавить(Элементы.СписокКонтекстноеМенюПровести);
		КомандыРедактирования.Добавить(Элементы.СписокКонтекстноеМенюОтменаПроведения);
		
		Для каждого КомандаРедактирования Из КомандыРедактирования Цикл
			КомандаРедактирования.Видимость = Ложь;
		КонецЦикла;
	КонецЕсли;
	
	//++ Локализация


	//-- Локализация
	
КонецПроцедуры

#Область НастройкиДинамическихСписков

&НаСервере
Процедура ИнициироватьНастройкиДинамическихСписков()
	
	ПараметрыСписковДокументов = Новый Массив;
	
	СтруктураПараметровСписка = РаботаСЖурналамиДокументов.СтруктураФормированияНаФормеГруппыПользовательскихНастроекДинамическогоСписка();
	СтруктураПараметровСписка.ИмяСписка = "СписокДокументов";
	СтруктураПараметровСписка.ГруппаРазмещенияНастройки = Элементы.ГруппаНастройкиСпискаДокументов;
	СтруктураПараметровСписка.ИмяРеквизитаРежимАвтообновления = "СписокДокументовРежимАвтообновления";
	СтруктураПараметровСписка.ИмяКомандыОбновленияСписка = Команды.СписокДокументовОбновить.Имя;
	ПараметрыСписковДокументов.Добавить(СтруктураПараметровСписка);
	
	РаботаСЖурналамиДокументов.ИнициироватьНастройкиДинамическихСписков(ЭтотОбъект, ПараметрыСписковДокументов);

КонецПроцедуры

&НаКлиенте
Процедура ОтображениеГруппыПользовательскихОтборовИНастроек(ИмяСписка)
	
	ДлительноеОбновление = РаботаСЖурналамиДокументовКлиент.ВремяОбновленияСпискаПревышаетДопутимое(ЭтотОбъект,
		ИмяСписка);
		
	Если ДлительноеОбновление Тогда
		РаботаСЖурналамиДокументовКлиент.УстановитьЗначениеНастройкиСпискаДокументов(ЭтотОбъект, ИмяСписка,
			"ПровереныНастройкиКомпоновкиДанных", Истина);
		СтруктураНастроекКомпоновкиДанных = ПолучитьИсполняемыеНастройкиКомпоновкиДанных(ИмяСписка);
		РаботаСЖурналамиДокументовКлиент.УстановитьЗначениеНастройкиСпискаДокументов(ЭтотОбъект, ИмяСписка,
			"НастройкиКомпоновкиДанных", СтруктураНастроекКомпоновкиДанных.НастройкиКомпоновкиДанных);
		РаботаСЖурналамиДокументовКлиент.УстановитьЗначениеНастройкиСпискаДокументов(ЭтотОбъект, ИмяСписка,
			"СтруктураПользовательскихНастроек", СтруктураНастроекКомпоновкиДанных.СтруктураПользовательскихНастроек);
	Иначе
		РаботаСЖурналамиДокументовКлиент.УстановитьЗначениеНастройкиСпискаДокументов(ЭтотОбъект, ИмяСписка,
			"ПровереныНастройкиКомпоновкиДанных", Ложь);
		РаботаСЖурналамиДокументовКлиент.УстановитьЗначениеНастройкиСпискаДокументов(ЭтотОбъект, ИмяСписка,
			"НастройкиКомпоновкиДанных", Новый НастройкиКомпоновкиДанных);
		РаботаСЖурналамиДокументовКлиент.УстановитьЗначениеНастройкиСпискаДокументов(ЭтотОбъект, ИмяСписка,
			"СтруктураПользовательскихНастроек", Новый Структура);
	КонецЕсли;

	РаботаСЖурналамиДокументовКлиент.ДокументыОтображениеГруппыПользовательскихОтборовИНастроек(ЭтотОбъект, ИмяСписка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИсполняемыеНастройкиКомпоновкиДанных(ИмяСписка)
	
	ИмяЭлемента = РаботаСЖурналамиДокументов.ЗначениеНастройкиСпискаДокументов(ЭтотОбъект, ИмяСписка,
		"ИмяЭлементаСписка");
	ЭлементФормыСписок = Элементы[ИмяЭлемента];
	НастройкиКомпоновкиДанных = ЭлементФормыСписок.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("НастройкиКомпоновкиДанных", НастройкиКомпоновкиДанных);

	СписокПолейСоставногоТипа = РаботаСЖурналамиДокументов.ЗначениеНастройкиСпискаДокументов(ЭтотОбъект,
		ИмяСписка, "СписокПолейСоставногоТипа");

	СтруктураПользовательскихНастроек = РаботаСЖурналамиДокументов.ПроверитьПользовательскиеНастройкиДинамическогоСписка(
		НастройкиКомпоновкиДанных, СписокПолейСоставногоТипа);

	СтруктураВозврата.Вставить("СтруктураПользовательскихНастроек", СтруктураПользовательскихНастроек);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрыОбновленияСписковДокументов(ДанныеУстарели, ДлительностьОбновления = Неопределено)
	
	ИмяНастройки = "СписокДокументовКэшНастроек";
	ИмяСписка = "";
	Для Каждого НастройкаСписокДокументов Из ЭтотОбъект[ИмяНастройки] Цикл
		ИмяСписка = НастройкаСписокДокументов.Ключ;
		РаботаСЖурналамиДокументовКлиент.УстановитьПараметрыОбновленияСпискаДокументов(ЭтотОбъект, ИмяСписка, ДанныеУстарели,
			ДлительностьОбновления);
		ОтображениеГруппыПользовательскихОтборовИНастроек(ИмяСписка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеСпискаДокументовСЗамеромВремени(ИмяСписка, УчитыватьПараметрАвтообновления = Ложь)

	Если Не УчитыватьПараметрАвтообновления Тогда

		ТребуетсяОбновлениеСписка = Истина;

	Иначе

		ТребуетсяОбновлениеСписка = РаботаСЖурналамиДокументовКлиент.ЗначениеНастройкиАвтообновленияСпискаДокументов(
			ЭтотОбъект, ИмяСписка);

		Если Не ТребуетсяОбновлениеСписка Тогда
			РаботаСЖурналамиДокументовКлиент.УстановитьПризнакОтображенияНеактуальныхДанныхВСписке(ЭтотОбъект, ИмяСписка);
		КонецЕсли;

	КонецЕсли;

	Если ТребуетсяОбновлениеСписка Тогда

		РаботаСЖурналамиДокументовКлиент.ОбновитьДанныеСпискаДокументовСЗамеромВремени(ЭтотОбъект, ИмяСписка);
		ОтображениеГруппыПользовательскихОтборовИНастроек(ИмяСписка);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДокументовСобытиеОбработкаОповещения(ИмяСписка, Параметр = Неопределено)
	
	РаботаСЖурналамиДокументовКлиент.ОбновитьСписокДокументовСобытиеОбработкаОповещения(ЭтотОбъект, ИмяСписка, Параметр);
	ОтображениеГруппыПользовательскихОтборовИНастроек(ИмяСписка);

КонецПроцедуры

// Обработка события элемента формы.
// 
// Параметры:
//  Элемент - ПолеФормы
//@skip-check module-unused-method
&НаКлиенте
Процедура СписокДокументовОбработкаСобытияЭлементаФормы(Элемент)

	ДействиеСписка = РаботаСЖурналамиДокументовКлиент.ИмяСпискаДокументовПоИмениЭлементаФормы(ЭтотОбъект, Элемент.Имя);
	
	Если ДействиеСписка.ИмяСписка = "" Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСписка = ДействиеСписка.ИмяСписка;
	Действие = ДействиеСписка.Действие;
	
	Если Действие = "Отборы" Или Действие = "Порядок" Или Действие = "УсловноеОформление" Тогда
		РаботаСЖурналамиДокументовКлиент.УстановитьЗначениеНастройкиСпискаДокументов(ЭтотОбъект, ИмяСписка,
			"ПровереныНастройкиКомпоновкиДанных", Истина);
		СтруктураНастроекКомпоновкиДанных = ПолучитьИсполняемыеНастройкиКомпоновкиДанных(ИмяСписка);
		РаботаСЖурналамиДокументовКлиент.УстановитьЗначениеНастройкиСпискаДокументов(ЭтотОбъект, ИмяСписка,
			"НастройкиКомпоновкиДанных", СтруктураНастроекКомпоновкиДанных.НастройкиКомпоновкиДанных);
		РаботаСЖурналамиДокументовКлиент.УстановитьЗначениеНастройкиСпискаДокументов(ЭтотОбъект, ИмяСписка,
			"СтруктураПользовательскихНастроек", СтруктураНастроекКомпоновкиДанных.СтруктураПользовательскихНастроек);
	КонецЕсли;
	
	Если Действие = "Отборы" Тогда
		РаботаСЖурналамиДокументовКлиент.ИсправитьПользовательскиеОтборыВСпискеДокументов(ЭтотОбъект, ИмяСписка);
	ИначеЕсли Действие = "Порядок" Тогда
		РаботаСЖурналамиДокументовКлиент.ИсправитьНастройкиСортировкиВСпискеДокументов(ЭтотОбъект, ИмяСписка);
	ИначеЕсли Действие = "УсловноеОформление" Тогда
		РаботаСЖурналамиДокументовКлиент.ИсправитьНастройкиУсловногоОформленияВСпискеДокументов(ЭтотОбъект, ИмяСписка);
	ИначеЕсли Действие = "Обновление" Тогда
		ОбновитьДанныеСпискаДокументовСЗамеромВремени(ИмяСписка);
	ИначеЕсли Действие = "УскорениеОбновленияСписка" Тогда
		РаботаСЖурналамиДокументовКлиент.СохранитьНастройкуПроизводительныйРежимОбновленияСписка(ЭтотОбъект, ИмяСписка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыборВариантаОтбораДокументов()
	
	СписокВариантовОтбора = СписокВариантовОтбора();
	ОписаниеОповещенияОВыбореВарианта = Новый ОписаниеОповещения("ПриВыбореВариантаОтбораДокументов", ЭтотОбъект);
	СписокВариантовОтбора.ПоказатьВыборЭлемента(
		ОписаниеОповещенияОВыбореВарианта,
		НСтр("ru = 'Варианты отбора документов'"),
		СписокВариантовОтбора.НайтиПоЗначению(ТекущийВариантОтбораДокументов));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВариантОтбораДокументовПоУмолчанию()
	Возврат "ВсеДокументы";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СписокВариантовОтбора()
	
	СписокВариантовОтбора = Новый СписокЗначений;
	СписокВариантовОтбора.Добавить(ВариантОтбораДокументовПоУмолчанию(), НСтр("ru = 'Все документы журнала'"));
	СписокВариантовОтбора.Добавить("ЭлектронныеБилеты", НСтр("ru = 'Электронные билеты'"));
	СписокВариантовОтбора.Добавить("ЭлектронныеБилетыИОперации", НСтр("ru = 'Электронные билеты и операции'"));
	
	//++ Локализация
	СписокВариантовОтбора.Добавить("ЭлектронныеБилетыИБронирования", НСтр("ru = 'Электронные билеты и бронирования'"));
	//-- Локализация
	
	Возврат СписокВариантовОтбора;
	
КонецФункции

&НаКлиенте
Процедура ПриВыбореВариантаОтбораДокументов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = ТекущийВариантОтбораДокументов Тогда
		Возврат;
	КонецЕсли;
	
	ПрименитьВариантОтбораДокументов(Результат.Значение);
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьВариантОтбораДокументов(ВариантОтбораДокументов)
	
	// Фиксация текущего варианта
	ТекущийВариантОтбораДокументов = ВариантОтбораДокументов;
	
	// Перерисовка кнопок создания
	ВидимостьКомандРедактирования = ПравоДоступа("Добавление", Метаданные.Документы.ОперацияСЭлектроннымБилетом);
	
	Элементы.СписокСоздатьБилет.Видимость = ВидимостьКомандРедактирования;
	Элементы.СписокСоздатьДоплату.Видимость = ВидимостьКомандРедактирования;
	Элементы.СписокСоздатьВозврат.Видимость = ВидимостьКомандРедактирования;
	
	//++ Локализация
	Элементы.СписокСоздатьБронирование.Видимость = ВидимостьКомандРедактирования;
	//-- Локализация
	
	СписокТиповДокументов = Новый СписокЗначений;
	СписокТиповДокументов.Добавить(1);
	
	Если ТекущийВариантОтбораДокументов = "ЭлектронныеБилеты" Тогда
		
		Элементы.СписокСоздатьДоплату.Видимость = Ложь;
		Элементы.СписокСоздатьВозврат.Видимость = Ложь;
		
		//++ Локализация
		Элементы.СписокСоздатьБронирование.Видимость = Ложь;
		//-- Локализация
		
	ИначеЕсли ТекущийВариантОтбораДокументов = "ЭлектронныеБилетыИОперации" Тогда
		
		//++ Локализация
		Элементы.СписокСоздатьБронирование.Видимость = Ложь;
		//-- Локализация
		
		СписокТиповДокументов.Добавить(2);
		СписокТиповДокументов.Добавить(3);
		
	//++ Локализация
	ИначеЕсли ТекущийВариантОтбораДокументов = "ЭлектронныеБилетыИБронирования" Тогда
		
		Элементы.СписокСоздатьДоплату.Видимость = Ложь;
		Элементы.СписокСоздатьВозврат.Видимость = Ложь;
		СписокТиповДокументов.Добавить(4);
	//-- Локализация
		
	Иначе
		
		СписокТиповДокументов.Добавить(2);
		СписокТиповДокументов.Добавить(3);
		СписокТиповДокументов.Добавить(4);
		
	КонецЕсли;
	
	// Отбор динамического списка
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокДокументов,
		"ИдентификаторТипаДокумента",
		СписокТиповДокументов,
		ВидСравненияКомпоновкиДанных.ВСписке,,
		Истина);
	
	// Формирование гиперссылки
	МассивСтрокНадписи = Новый Массив;
	МассивСтрокНадписи.Добавить(СтрШаблон(НСтр("ru = 'Показаны %1'"),
		НРег(СписокВариантовОтбора().НайтиПоЗначению(ТекущийВариантОтбораДокументов).Представление)));
	МассивСтрокНадписи.Добавить("  ");
	МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Настроить'"),,,,"НастроитьОтбор"));
	//
	Элементы.ИнформационнаяНадписьОтбор.Заголовок = Новый ФорматированнаяСтрока(МассивСтрокНадписи);
	
КонецПроцедуры

Процедура УстановитьТекстЗапросаСпискуДокументов()
	
	МассивТекстов = Новый Массив;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ОперацияСЭлектроннымБилетом) КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ДанныеДокументаПереопределяемый.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
	|			ТОГДА &ТипДокументаДоплата
	|		КОГДА ДанныеДокументаПереопределяемый.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|			ТОГДА &ТипДокументаВозврат
	|		ИНАЧЕ &ТипДокументаЭлектронныйБилет
	|	КОНЕЦ КАК ТипДокумента,
	|	ВЫБОР
	|		КОГДА ДанныеДокументаПереопределяемый.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
	|			ТОГДА 2
	|		КОГДА ДанныеДокументаПереопределяемый.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|			ТОГДА 3
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ИдентификаторТипаДокумента,
	|	ДанныеДокументаПереопределяемый.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.ПустаяСсылка) КАК ЭтоЭлектронныйБилет,
	|	РеестрДокументовПереопределяемый.ДатаДокументаИБ КАК Дата,
	|	ВЫБОР
	|		КОГДА СведенияОбЭлектронномБилетеПереопределяемый.Ссылка Есть NULL
	|			ТОГДА РеестрДокументовПереопределяемый.НомерПервичногоДокумента
	|		ИНАЧЕ ДанныеДокументаПереопределяемый.НомерБилета
	|	КОНЕЦ КАК Номер,
	|	РеестрДокументовПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	|	РеестрДокументовПереопределяемый.Проведен КАК Проведен,
	|	РеестрДокументовПереопределяемый.Организация КАК Организация,
	|	ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.МестоХранения.Ключ КАК Справочник.ФизическиеЛица) КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ДанныеДокументаПереопределяемый.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.ПустаяСсылка)
	|			ТОГДА ДанныеДокументаПереопределяемый.ФИОПассажира
	|		ИНАЧЕ СведенияОбЭлектронномБилетеПереопределяемый.ФИОПассажира
	|	КОНЕЦ КАК ФИОПассажира,
	|	РеестрДокументовПереопределяемый.Партнер КАК Партнер,
	|	РеестрДокументовПереопределяемый.Контрагент КАК Контрагент,
	|	РеестрДокументовПереопределяемый.Подразделение КАК Подразделение,
	|	РеестрДокументовПереопределяемый.Ответственный КАК Ответственный,
	|	РеестрДокументовПереопределяемый.Комментарий КАК Комментарий,
	|	РеестрДокументовПереопределяемый.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТИПЗНАЧЕНИЯ(РеестрДокументовПереопределяемый.Ссылка) КАК Тип,
	|	РеестрДокументовПереопределяемый.Сумма КАК Сумма,
	|	РеестрДокументовПереопределяемый.Валюта КАК Валюта,
	|	ДанныеДокументаПереопределяемый.ТипУслуги КАК ТипУслуги,
	|	ДанныеДокументаПереопределяемый.ДатаОтправления КАК ДатаБрони,
	|	ДанныеДокументаПереопределяемый.ДеталиПоездки КАК ДеталиПоездки,
	|	ВЫБОР
	|		КОГДА ДанныеДокументаПереопределяемый.ТипОперации
	|			В (ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата), ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокументаПереопределяемый.Состояние КОНЕЦ КАК Состояние,
	|	ДанныеДокументаПереопределяемый.ДокументОснование КАК Заявка,
	|	ДанныеДокументаПереопределяемый.ДатаОтправления КАК ДатаОтправления,
	|	ДанныеДокументаПереопределяемый.ДатаПрибытия КАК ДатаПрибытия,
	|	ВЫБОР
	|		КОГДА РеестрДокументовПереопределяемый.Проведен
	|			ТОГДА 0
	|		КОГДА РеестрДокументовПереопределяемый.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК НестандартнаяКартинка,
	|	&СтатусПроверки КАК СтатусПроверки,
	|	&ИндикаторПроверки КАК ИндикаторПроверки,
	|	РеестрДокументовПереопределяемый.ТипСсылки КАК ТипСсылки,
	|	РеестрДокументовПереопределяемый.ИдентификаторЗаписи КАК ИдентификаторЗаписи
	|ИЗ
	|	РегистрСведений.РеестрДокументов КАК РеестрДокументовПереопределяемый
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияСЭлектроннымБилетом КАК ДанныеДокументаПереопределяемый
	|		ПО (ДанныеДокументаПереопределяемый.Ссылка = РеестрДокументовПереопределяемый.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацияСЭлектроннымБилетом КАК СведенияОбЭлектронномБилетеПереопределяемый
	|		ПО ДанныеДокументаПереопределяемый.ЭлектронныйБилет = СведенияОбЭлектронномБилетеПереопределяемый.Ссылка
	|ГДЕ
	|	РеестрДокументовПереопределяемый.ТипСсылки В(&ИдОбъектаОперацияСЭлектроннымБилетом)
	|	И Не ДанныеДокументаПереопределяемый.УдалитьТипБронирования = ЗНАЧЕНИЕ(Перечисление.УдалитьТипыБронирования.Бронирование)
	|{ГДЕ
	|	(ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ОперацияСЭлектроннымБилетом)).* КАК Ссылка,
	|	РеестрДокументовПереопределяемый.Организация.* КАК Организация,
	|	РеестрДокументовПереопределяемый.ДатаДокументаИБ КАК Дата,
	|	РеестрДокументовПереопределяемый.НомерПервичногоДокумента КАК Номер,
	|	РеестрДокументовПереопределяемый.ТипСсылки КАК ТипСсылки,
	|	РеестрДокументовПереопределяемый.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	(ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.МестоХранения.Ключ КАК Справочник.ФизическиеЛица)).* КАК Сотрудник,
	|	РеестрДокументовПереопределяемый.Партнер.* КАК Партнер,
	|	РеестрДокументовПереопределяемый.Контрагент.* КАК Контрагент,
	|	РеестрДокументовПереопределяемый.Валюта.* КАК Валюта,
	|	РеестрДокументовПереопределяемый.Подразделение.* КАК Подразделение,
	|	РеестрДокументовПереопределяемый.Ответственный.* КАК Ответственный,
	|	РеестрДокументовПереопределяемый.Дополнительно КАК НазначениеПлатежа,
	|	РеестрДокументовПереопределяемый.Комментарий КАК Комментарий,
	|	РеестрДокументовПереопределяемый.Проведен КАК Проведен,
	|	РеестрДокументовПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	|	(РеестрДокументовПереопределяемый.ДатаОтраженияВУчете МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				И РеестрДокументовПереопределяемый.ДатаОтраженияВУчете >= &НачалоПериода
	|				И НЕ РеестрДокументовПереопределяемый.ДополнительнаяЗапись)}";
	
	МассивТекстов.Добавить(ТекстЗапроса);
	
	//++ Локализация
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.БронированиеSmartway) КАК Ссылка,
	|	&ТипДокументаБронирование КАК ТипДокумента,
	|	4 КАК ИдентификаторТипаДокумента,
	|	ЛОЖЬ КАК ЭтоЭлектронныйБилет,
	|	РеестрДокументовПереопределяемый.ДатаДокументаИБ КАК Дата,
	|	РеестрДокументовПереопределяемый.НомерПервичногоДокумента КАК Номер,
	|	РеестрДокументовПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	|	РеестрДокументовПереопределяемый.Проведен КАК Проведен,
	|	РеестрДокументовПереопределяемый.Организация КАК Организация,
	|	ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.МестоХранения.Ключ КАК Справочник.ФизическиеЛица) КАК Сотрудник,
	|	НЕОПРЕДЕЛЕНО КАК ФИОПассажира,
	|	РеестрДокументовПереопределяемый.Партнер КАК Партнер,
	|	РеестрДокументовПереопределяемый.Контрагент КАК Контрагент,
	|	РеестрДокументовПереопределяемый.Подразделение КАК Подразделение,
	|	РеестрДокументовПереопределяемый.Ответственный КАК Ответственный,
	|	РеестрДокументовПереопределяемый.Комментарий КАК Комментарий,
	|	РеестрДокументовПереопределяемый.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТИПЗНАЧЕНИЯ(РеестрДокументовПереопределяемый.Ссылка) КАК Тип,
	|	РеестрДокументовПереопределяемый.Сумма КАК Сумма,
	|	РеестрДокументовПереопределяемый.Валюта КАК Валюта,
	|	ДанныеДокументаПереопределяемый.ТипУслуги КАК ТипУслуги,
	|	ДанныеДокументаПереопределяемый.ДатаНачала КАК ДатаБрони,
	|	ДанныеДокументаПереопределяемый.ДеталиБронирования КАК ДеталиПоездки,
	|	ДанныеДокументаПереопределяемый.Состояние КАК Состояние,
	|	ДанныеДокументаПереопределяемый.ДокументОснование КАК Заявка,
	|	ДанныеДокументаПереопределяемый.ДатаНачала КАК ДатаОтправления,
	|	ДанныеДокументаПереопределяемый.ДатаОкончания КАК ДатаПрибытия,
	|	ВЫБОР
	|		КОГДА РеестрДокументовПереопределяемый.Проведен
	|			ТОГДА 0
	|		КОГДА РеестрДокументовПереопределяемый.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК НестандартнаяКартинка,
	|	&СтатусПроверки КАК СтатусПроверки,
	|	&ИндикаторПроверки КАК ИндикаторПроверки,
	|	РеестрДокументовПереопределяемый.ТипСсылки КАК ТипСсылки,
	|	РеестрДокументовПереопределяемый.ИдентификаторЗаписи КАК ИдентификаторЗаписи
	|ИЗ
	|	РегистрСведений.РеестрДокументов КАК РеестрДокументовПереопределяемый
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БронированиеSmartway КАК ДанныеДокументаПереопределяемый
	|		ПО (ДанныеДокументаПереопределяемый.Ссылка = РеестрДокументовПереопределяемый.Ссылка)
	|ГДЕ
	|	РеестрДокументовПереопределяемый.ТипСсылки В(&ИдОбъектаБронирование)
	|{ГДЕ
	|	(ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ОперацияСЭлектроннымБилетом)).* КАК Ссылка,
	|	РеестрДокументовПереопределяемый.Организация.* КАК Организация,
	|	РеестрДокументовПереопределяемый.ДатаДокументаИБ КАК Дата,
	|	РеестрДокументовПереопределяемый.НомерПервичногоДокумента КАК Номер,
	|	РеестрДокументовПереопределяемый.ТипСсылки КАК ТипСсылки,
	|	РеестрДокументовПереопределяемый.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	(ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.МестоХранения.Ключ КАК Справочник.ФизическиеЛица)).* КАК Сотрудник,
	|	РеестрДокументовПереопределяемый.Партнер.* КАК Партнер,
	|	РеестрДокументовПереопределяемый.Контрагент.* КАК Контрагент,
	|	РеестрДокументовПереопределяемый.Валюта.* КАК Валюта,
	|	РеестрДокументовПереопределяемый.Подразделение.* КАК Подразделение,
	|	РеестрДокументовПереопределяемый.Ответственный.* КАК Ответственный,
	|	РеестрДокументовПереопределяемый.Дополнительно КАК НазначениеПлатежа,
	|	РеестрДокументовПереопределяемый.Комментарий КАК Комментарий,
	|	РеестрДокументовПереопределяемый.Проведен КАК Проведен,
	|	РеестрДокументовПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	|	(РеестрДокументовПереопределяемый.ДатаОтраженияВУчете МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				И РеестрДокументовПереопределяемый.ДатаОтраженияВУчете >= &НачалоПериода
	|				И НЕ РеестрДокументовПереопределяемый.ДополнительнаяЗапись)}";
	
	МассивТекстов.Добавить(ТекстЗапроса);
	//-- Локализация
	
	СписокДокументов.ТекстЗапроса = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
